lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
#pragma once

#include <stddef.h>
#include <stdint.h>

#include "nrf54l15_hal.h"
#include "nrf54l15_vpr.h"

class Stream;

namespace xiao_nrf54l15 {

constexpr size_t kBleCsMaxSwitchPatternCount = 8U;
constexpr size_t kBleCsChannelMapBytes = 10U;
constexpr uint8_t kBleCsMainMode1 = 0x1U;
constexpr uint8_t kBleCsMainMode2 = 0x2U;
constexpr uint8_t kBleCsMainMode3 = 0x3U;
constexpr uint8_t kBleCsToneQualityHigh = 0x0U;
constexpr uint8_t kBleCsToneQualityMedium = 0x1U;
constexpr uint8_t kBleCsToneQualityLow = 0x2U;
constexpr uint8_t kBleCsToneQualityUnavailable = 0x3U;
constexpr uint8_t kBleCsToneExtensionNone = 0x0U;
constexpr uint8_t kBleCsToneExtensionUnexpected = 0x1U;
constexpr uint8_t kBleCsToneExtensionExpected = 0x2U;
constexpr uint8_t kBleCsPacketQualityAaCheckOk = 0x0U;
constexpr uint8_t kBleCsPacketQualityAaCheckBitErrors = 0x1U;
constexpr uint8_t kBleCsPacketQualityAaCheckNotFound = 0x2U;
constexpr uint8_t kBleCsPacketRssiNotAvailable = 0x7FU;
constexpr int16_t kBleCsTimeDifferenceNotAvailable =
    static_cast<int16_t>(0x8000);
constexpr uint8_t kBleCsProcedureDoneComplete = 0x0U;
constexpr uint8_t kBleCsProcedureDonePartial = 0x1U;
constexpr uint8_t kBleCsProcedureDoneAborted = 0xFU;
constexpr uint8_t kBleCsSubeventDoneComplete = 0x0U;
constexpr uint8_t kBleCsSubeventDonePartial = 0x1U;
constexpr uint8_t kBleCsSubeventDoneAborted = 0xFU;
constexpr uint16_t kBleCsHciOpReadRemoteSupportedCapabilities = 0x208AU;
constexpr uint16_t kBleCsHciOpWriteCachedRemoteSupportedCapabilities = 0x208BU;
constexpr uint16_t kBleCsHciOpSecurityEnable = 0x208CU;
constexpr uint16_t kBleCsHciOpSetDefaultSettings = 0x208DU;
constexpr uint16_t kBleCsHciOpReadRemoteFaeTable = 0x208EU;
constexpr uint16_t kBleCsHciOpWriteCachedRemoteFaeTable = 0x208FU;
constexpr uint16_t kBleCsHciOpCreateConfig = 0x2090U;
constexpr uint16_t kBleCsHciOpRemoveConfig = 0x2091U;
constexpr uint16_t kBleCsHciOpSetChannelClassification = 0x2092U;
constexpr uint16_t kBleCsHciOpSetProcedureParameters = 0x2093U;
constexpr uint16_t kBleCsHciOpProcedureEnable = 0x2094U;
constexpr uint16_t kBleCsHciOpTest = 0x2095U;
constexpr uint16_t kBleCsHciOpTestEnd = 0x2096U;
constexpr uint16_t kBleCsHciOpWriteCachedRemoteSupportedCapabilitiesV2 = 0x20A6U;
constexpr uint8_t kBleCsHciEvtReadRemoteSupportedCapabilitiesComplete = 0x2CU;
constexpr uint8_t kBleCsHciEvtReadRemoteFaeTableComplete = 0x2DU;
constexpr uint8_t kBleCsHciEvtReadRemoteSupportedCapabilitiesCompleteV2 = 0x38U;
constexpr uint8_t kBleCsHciEvtSecurityEnableComplete = 0x2EU;
constexpr uint8_t kBleCsHciEvtConfigComplete = 0x2FU;
constexpr uint8_t kBleCsHciEvtProcedureEnableComplete = 0x30U;
constexpr uint8_t kBleCsHciEvtSubeventResult = 0x31U;
constexpr uint8_t kBleCsHciEvtSubeventResultContinue = 0x32U;
constexpr uint8_t kBleCsHciEvtTestEndComplete = 0x33U;
constexpr uint8_t kBleHciPacketTypeCommand = 0x01U;
constexpr uint8_t kBleHciPacketTypeAcl = 0x02U;
constexpr uint8_t kBleHciPacketTypeSco = 0x03U;
constexpr uint8_t kBleHciPacketTypeEvent = 0x04U;
constexpr uint8_t kBleHciPacketTypeIso = 0x05U;
constexpr uint8_t kBleHciEvtCommandComplete = 0x0EU;
constexpr uint8_t kBleHciEvtCommandStatus = 0x0FU;
constexpr uint8_t kBleHciEvtLeMeta = 0x3EU;
constexpr uint8_t kBleHciEvtVendor = 0xFFU;
constexpr size_t kBleCsMaxControllerStepDataBytes = 1024U;
constexpr size_t kBleCsMaxHciCommandPayloadBytes = 128U;
constexpr size_t kBleCsFaeTableValueCount = 72U;
constexpr size_t kBleCsMaxTestChannelCount = 37U;
constexpr uint16_t kBleCsTestOverrideChannelSelection = (1U << 0U);
constexpr uint16_t kBleCsTestOverrideMainModeSteps = (1U << 2U);
constexpr uint16_t kBleCsTestOverrideToneExtension = (1U << 3U);
constexpr uint16_t kBleCsTestOverrideAntennaPermutation = (1U << 4U);
constexpr uint16_t kBleCsTestOverrideAccessAddresses = (1U << 5U);
constexpr uint16_t kBleCsTestOverrideMarkerPositions = (1U << 6U);
constexpr uint16_t kBleCsTestOverrideMarkerValue = (1U << 7U);
constexpr uint16_t kBleCsTestOverridePayload = (1U << 8U);
constexpr uint16_t kBleCsTestOverrideStablePhase = (1U << 10U);
constexpr uint16_t kBleCsTestSupportedOverrideMask =
    kBleCsTestOverrideChannelSelection |
    kBleCsTestOverrideMainModeSteps |
    kBleCsTestOverrideToneExtension |
    kBleCsTestOverrideAntennaPermutation |
    kBleCsTestOverrideAccessAddresses |
    kBleCsTestOverrideMarkerPositions |
    kBleCsTestOverrideMarkerValue |
    kBleCsTestOverridePayload |
    kBleCsTestOverrideStablePhase;

struct BleCsToneSample {
  bool valid = false;
  int8_t rssiDbm = 0;
  uint8_t cteTimeUnits = 0;
  uint8_t cteType = 0;
  int16_t i = 0;
  int16_t q = 0;
  uint16_t magnitude = 0;
  uint16_t magnitudeStd = 0;
  uint16_t phase = 0;
};

struct BleCsDfeCaptureInfo {
  bool present = false;
  bool allZero = true;
  uint16_t amountBytes = 0U;
  uint16_t currentAmountBytes = 0U;
};

struct BleCsIqSample {
  int16_t i = 0;
  int16_t q = 0;
};

struct BleCsSubeventStep {
  uint8_t mode = 0U;
  uint8_t channel = 0U;
  uint8_t dataLen = 0U;
  const uint8_t* data = nullptr;
};

struct BleCsStepMode1Data {
  uint8_t aaCheckQuality = kBleCsPacketQualityAaCheckNotFound;
  uint8_t bitErrors = 0x0FU;
  uint8_t nadm = 0xFFU;
  int8_t packetRssiDbm = 0;
  int16_t timeDifferenceHalfNs = kBleCsTimeDifferenceNotAvailable;
  uint8_t packetAntenna = 0U;
  bool hasRttSoundingSequence = false;
  BleCsIqSample soundingPct1{};
  BleCsIqSample soundingPct2{};
};

struct BleCsStepToneInfo {
  BleCsIqSample pct{};
  uint8_t qualityIndicator = kBleCsToneQualityUnavailable;
  uint8_t extensionIndicator = kBleCsToneExtensionExpected;
};

struct BleCsStepMode2Data {
  uint8_t antennaPermutationIndex = 0U;
  uint8_t toneCount = 0U;
};

struct BleCsStepMode3Data {
  BleCsStepMode1Data timing{};
  uint8_t antennaPermutationIndex = 0U;
  uint8_t toneCount = 0U;
  uint8_t toneDataOffset = 0U;
};

struct BleCsRttSample {
  bool present = false;
  bool valid = false;
  uint8_t aaCheckQuality = 0xFFU;
  uint8_t bitErrors = 0xFFU;
  uint8_t nadm = 0xFFU;
  int8_t packetRssiDbm = 0;
  int16_t timeDifferenceHalfNs = 0;
  uint8_t packetAntenna = 0U;
  uint8_t rawLen = 0U;
  uint8_t rawBytes[8] = {0};
};

