lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
struct BleCsChannelMeasurement {
  bool valid = false;
  uint8_t channelIndex = 0;
  uint8_t sequence = 0;
  BleCsToneSample localTone;
  BleCsToneSample peerTone;
  BleCsRttSample localRtt;
  BleCsRttSample peerRtt;
  float combinedPhaseRad = 0.0f;
  float rttDistanceMeters = 0.0f;
};

struct BleCsEstimate {
  bool valid = false;
  uint8_t totalToneChannels = 0;
  uint8_t usedChannels = 0;
  uint8_t rttChannels = 0;
  uint8_t rejectedLowQualityChannels = 0;
  uint8_t rejectedResidualChannels = 0;
  float distanceMeters = 0.0f;
  float phaseSlopeDistanceMeters = 0.0f;
  float rttDistanceMeters = 0.0f;
  float slopeRadPerHz = 0.0f;
  float residualVariance = 0.0f;
  float rttVariance = 0.0f;
  float medianToneQuality = 0.0f;
  float fitDeltaMeters = 0.0f;
};

struct BleCsCalibrationProfile {
  float scale = 1.0f;
  float offsetMeters = 0.0f;
  float referenceDistanceMeters = 0.0f;
  float measuredMedianMeters = 0.0f;
  float measuredMadMeters = 0.0f;
  float boardPairBiasMeters = 0.0f;
  float boardPairEquivalentDelayNs = 0.0f;
  float symmetricPerBoardEquivalentDelayNs = 0.0f;
  float validatedMedianMeters = 0.0f;
  float validatedMadMeters = 0.0f;
  float validatedP90AbsErrorMeters = 0.0f;
  uint16_t sampleCount = 0U;
  uint16_t validatedSampleCount = 0U;
};

struct BleCsPhysicalDistanceEstimate {
  bool valid = false;
  float distanceMeters = 0.0f;
  float typicalErrorMeters = 0.0f;
  float conservativeErrorMeters = 0.0f;
  float lowerBoundMeters = 0.0f;
  float upperBoundMeters = 0.0f;
  uint16_t sampleCount = 0U;
};

struct BleCsSubeventResultHeader {
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint16_t startAclConnEventCounter = 0U;
  uint16_t procedureCounter = 0U;
  uint16_t frequencyCompensation = 0U;
  int8_t referencePowerLevelDbm = 0;
  uint8_t procedureDoneStatus = kBleCsProcedureDoneComplete;
  uint8_t subeventDoneStatus = kBleCsSubeventDoneComplete;
  uint8_t procedureAbortReason = 0U;
  uint8_t subeventAbortReason = 0U;
  uint8_t numAntennaPaths = 0U;
  uint16_t numStepsReported = 0U;
};

struct BleCsSubeventResult {
  BleCsSubeventResultHeader header{};
  const uint8_t* stepData = nullptr;
  uint16_t stepDataLen = 0U;
  bool isPartial = false;
  bool isComplete = false;
  bool isContinuation = false;
};

struct BleCsHciCommand {
  uint16_t opcode = 0U;
  uint8_t payload[kBleCsMaxHciCommandPayloadBytes] = {0};
  uint8_t payloadLen = 0U;
};

struct BleCsHciCommandStatusEvent {
  uint8_t status = 0U;
  uint8_t numCommandPackets = 0U;
  uint16_t opcode = 0U;
};

struct BleCsHciCommandCompleteEvent {
  uint8_t status = 0U;
  uint8_t numCommandPackets = 0U;
  uint16_t opcode = 0U;
  const uint8_t* returnParams = nullptr;
  uint8_t returnParamsLen = 0U;
};

struct BleCsHciLeMetaEvent {
  uint8_t subeventCode = 0U;
  const uint8_t* payload = nullptr;
  uint8_t payloadLen = 0U;
};

enum class BleCsControllerResultSource : uint8_t {
  kLocal = 0U,
  kPeer,
};

enum class BleCsControllerIngressSource : uint8_t {
  kController = 0U,
  kLocalResult,
  kPeerResult,
};

struct BleCsControllerCapabilities {
  bool valid = false;
  bool isV2 = false;
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  uint8_t numConfigSupported = 0U;
  uint16_t maxConsecutiveProceduresSupported = 0U;
  uint8_t numAntennasSupported = 0U;
  uint8_t maxAntennaPathsSupported = 0U;
  bool initiatorSupported = false;
  bool reflectorSupported = false;
  bool mode3Supported = false;
  uint8_t rttCapability = 0U;
  uint8_t rttAaOnlyN = 0U;
  uint8_t rttSoundingN = 0U;
  uint8_t rttRandomPayloadN = 0U;
  uint16_t nadmSoundingCapability = 0U;
  uint16_t nadmRandomCapability = 0U;
  bool csSync2mPhySupported = false;
  bool csSync2m2btPhySupported = false;
  bool csWithoutFaeSupported = false;
  bool chselAlg3cSupported = false;
  bool pbrFromRttSoundingSeqSupported = false;
  bool csIptReflectorSupported = false;
  uint16_t tIp1TimesSupported = 0U;
  uint16_t tIp2TimesSupported = 0U;
  uint16_t tFcsTimesSupported = 0U;
  uint16_t tPmTimesSupported = 0U;
  uint8_t tSwTimeSupported = 0U;
  uint8_t txSnrCapability = 0U;
  uint16_t tIp2IptTimesSupported = 0U;
  uint8_t tSwIptTimeSupported = 0U;
};

struct BleCsDefaultSettings {
  bool enableInitiatorRole = false;
  bool enableReflectorRole = false;
  uint8_t csSyncAntennaSelection = 0xFFU;
  int8_t maxTxPowerDbm = 0;
};

struct BleCsControllerCreateConfig {
  uint8_t configId = 0U;
  uint8_t createContext = 0U;
  uint8_t mainModeType = 0U;
  uint8_t subModeType = 0U;
  uint8_t minMainModeSteps = 0U;
  uint8_t maxMainModeSteps = 0U;
  uint8_t mainModeRepetition = 0U;
  uint8_t mode0Steps = 0U;
  uint8_t role = 0U;
  uint8_t rttType = 0U;
  uint8_t csSyncPhy = 0U;
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
  uint8_t channelMapRepetition = 0U;
  uint8_t channelSelectionType = 0U;
  uint8_t ch3cShape = 0U;
  uint8_t ch3cJump = 0U;
  uint8_t csEnhancements1 = 0U;
};

struct BleCsProcedureParameters {
  uint8_t configId = 0U;
  uint16_t maxProcedureLen = 0U;
  uint16_t minProcedureInterval = 0U;
  uint16_t maxProcedureInterval = 0U;
  uint16_t maxProcedureCount = 0U;
  uint32_t minSubeventLen = 0U;
  uint32_t maxSubeventLen = 0U;
  uint8_t toneAntennaConfigSelection = 0U;
  uint8_t phy = 0U;
  int8_t txPowerDelta = 0;
  uint8_t preferredPeerAntenna = 0U;
  uint8_t snrControlInitiator = 0U;
  uint8_t snrControlReflector = 0U;
};

struct BleCsProcedureEnable {
  uint8_t configId = 0U;
  uint8_t enable = 0U;
};

struct BleCsSecurityEnableComplete {
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
};

struct BleCsConfigComplete {
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint8_t action = 0U;
  uint8_t mainModeType = 0U;
  uint8_t subModeType = 0U;
  uint8_t minMainModeSteps = 0U;
  uint8_t maxMainModeSteps = 0U;
  uint8_t mainModeRepetition = 0U;
  uint8_t mode0Steps = 0U;
  uint8_t role = 0U;
  uint8_t rttType = 0U;
  uint8_t csSyncPhy = 0U;
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
  uint8_t channelMapRepetition = 0U;
  uint8_t channelSelectionType = 0U;
  uint8_t ch3cShape = 0U;
  uint8_t ch3cJump = 0U;
  uint8_t csEnhancements1 = 0U;
  uint8_t tIp1TimeUs = 0U;
  uint8_t tIp2TimeUs = 0U;
  uint8_t tFcsTimeUs = 0U;
  uint8_t tPmTimeUs = 0U;
};

