lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
struct BleCsProcedureEnableComplete {
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint8_t state = 0U;
  uint8_t toneAntennaConfigSelection = 0U;
  int8_t selectedTxPower = 0;
  uint32_t subeventLen = 0U;
  uint8_t subeventsPerEvent = 0U;
  uint16_t subeventInterval = 0U;
  uint16_t eventInterval = 0U;
  uint16_t procedureInterval = 0U;
  uint16_t procedureCount = 0U;
  uint16_t maxProcedureLen = 0U;
};

// ─── Zephyr Parity: CS Test Mode ─────────────────────────────────

struct BleCsTestParams {
  uint8_t mainModeType = kBleCsMainMode2;
  uint8_t subModeType = 0xFFU;
  uint8_t mainModeRepetition = 1U;
  uint8_t mode0Steps = 0U;
  uint8_t role = 0U;
  uint8_t rttType = 0U;
  uint8_t csSyncPhy = 1U;
  uint8_t csSyncAntennaSelection = 0xFFU;
  uint32_t subeventLenUs = 1250U;
  uint16_t subeventInterval = 0U;
  uint8_t maxNumSubevents = 1U;
  uint8_t transmitPowerLevel = 0x7FU;
  uint8_t tIp1TimeUs = 10U;
  uint8_t tIp2TimeUs = 10U;
  uint8_t tFcsTimeUs = 15U;
  uint8_t tPmTimeUs = 10U;
  uint8_t tSwTimeUs = 0U;
  uint8_t toneAntennaConfigSelection = 0U;
  uint8_t csEnhancements1 = 0U;
  uint8_t snrControlInitiator = 0xFFU;
  uint8_t snrControlReflector = 0xFFU;
  uint16_t drbgNonce = 0U;
  uint8_t channelMapRepetition = 1U;
  uint16_t overrideConfig = 0U;

  // Override 0 always contributes data: a channel list when bit 0 is set,
  // otherwise a channel map and channel-selection parameters.
  uint8_t overrideChannelList[kBleCsMaxTestChannelCount] = {0};
  uint8_t overrideChannelListLen = 0U;
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
  uint8_t channelSelectionType = 0U;
  uint8_t ch3cShape = 0U;
  uint8_t ch3cJump = 2U;

  uint8_t overrideMainModeSteps = 0U;
  uint8_t overrideTpmToneExtension = 0U;
  uint8_t overrideToneAntennaPermutationIndex = 0U;
  uint32_t overrideCsSyncAccessAddressInitiator = 0U;
  uint32_t overrideCsSyncAccessAddressReflector = 0U;
  uint8_t overrideSsMarkerPositions[2] = {0};
  uint8_t overrideSsMarkerValue = 0U;
  uint8_t overrideCsSyncPayloadPattern = 0U;
  uint8_t overrideCsSyncUserPayload[16] = {0};
};

struct BleCsTestEndComplete {
  uint8_t status = 0U;
};

using BleCsTestComplete = BleCsTestEndComplete;

// ─── Zephyr Parity: Channel Classification ───────────────────────

struct BleCsChannelClassification {
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
};

// ─── Zephyr Parity: FAE Table ────────────────────────────────────

struct BleCsFaeTable {
  bool valid = false;
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  int8_t values[kBleCsFaeTableValueCount] = {0};
};

// ─── Zephyr Parity: Cached Capabilities ──────────────────────────

struct BleCsCachedCapabilities {
  uint16_t connHandle = 0U;
  BleCsControllerCapabilities capabilities{};
};

enum class BleCsControllerWorkflowPhase : uint8_t {
  kIdle = 0U,
  kNeedReadRemoteCapabilities,
  kWaitingRemoteCapabilities,
  kNeedSetDefaultSettings,
  kWaitingSetDefaultSettings,
  kNeedCreateConfig,
  kWaitingConfigComplete,
  kNeedSecurityEnable,
  kWaitingSecurityEnableComplete,
  kNeedSetProcedureParameters,
  kWaitingSetProcedureParameters,
  kNeedProcedureEnable,
  kWaitingProcedureEnableComplete,
  kReady,
  kFailed,
};

struct BleCsControllerWorkflowConfig {
  BleCsDefaultSettings defaultSettings{};
  BleCsControllerCreateConfig createConfig{};
  BleCsProcedureParameters procedureParameters{};
  BleCsProcedureEnable procedureEnable{};
  bool applyDefaultSettings = true;
  bool requireSecurityEnable = true;
};

struct BleCsControllerWorkflowState {
  BleCsControllerWorkflowPhase phase = BleCsControllerWorkflowPhase::kIdle;
  uint16_t connHandle = 0U;
  uint16_t lastOpcode = 0U;
  uint8_t lastStatus = 0U;
  bool remoteCapabilitiesValid = false;
  bool defaultSettingsApplied = false;
  bool configCreated = false;
  bool securityEnabled = false;
  bool procedureParametersApplied = false;
  bool procedureEnabled = false;
  BleCsControllerCapabilities remoteCapabilities{};
  BleCsConfigComplete configComplete{};
  BleCsProcedureEnableComplete procedureEnableComplete{};
};

struct BleCsConfig {
  uint32_t accessAddress = 0xA7DCE5B3UL;
  uint32_t crcInit = 0x445566UL;
  int8_t txPowerDbm = NRF54L15_CLEAN_BLE_DEFAULT_TX_DBM;
  uint8_t cteTimeUnits = 10U;
  uint8_t maxPayloadLength = 32U;
  uint8_t s0Pattern = 0xA5U;
  uint8_t controlChannel = 37U;
  uint16_t controlToProbeDelayUs = 2400U;
  uint16_t probeToReportDelayUs = 1200U;
  uint16_t controlListenWindowUs = 20000U;
  uint16_t probeListenWindowUs = 8000U;
  uint16_t responseListenWindowUs = 12000U;
  uint8_t probeRetries = 4U;
  uint16_t minToneMagnitude = 16U;
  // Bare RADIO RTT AUXDATA layout/channel semantics are not publicly documented
  // well enough to decode reliable ranging results in this clean-core path.
  bool enableRtt = false;
  bool rttFullAccessAddress = true;
  uint8_t rttNumSegments = 0U;
  uint16_t rttEfsDelay = 64U;
  float rttDistanceOffsetMeters = 0.0f;
  bool enableRawDfeCapture = false;
  uint8_t dfeSwitchPatternCount = 0U;
  uint8_t dfeSwitchPattern[kBleCsMaxSwitchPatternCount] = {0};
  uint8_t dfeRepeatPattern = 0U;
  int16_t dfeSwitchOffset16M = 0;
  int16_t dfeSampleOffset16M = 0;
};

class BleChannelSoundingRadio {
 public:
  explicit BleChannelSoundingRadio(uint32_t radioBase = nrf54l15::RADIO_BASE);

  bool begin(const BleCsConfig& config = BleCsConfig());
  void end();

  bool initialized() const;
  const BleCsConfig& config() const;

  bool measureChannel(uint8_t channelIndex, uint8_t sequence,
                      BleCsChannelMeasurement* outMeasurement);
  bool listenAndReflectOnce(uint32_t controlListenWindowUs = 0U);

  static float combinedPhaseRad(const BleCsChannelMeasurement& measurement);
  static bool rttDistanceMeters(const BleCsChannelMeasurement& measurement,
                                float* outDistanceMeters);
  static bool estimateDistancePhaseSlope(const BleCsChannelMeasurement* measurements,
                                         size_t count,
                                         BleCsEstimate* outEstimate);
  static float applyCalibrationProfile(float meters,
                                       const BleCsCalibrationProfile& profile);
  static bool estimatePhysicalDistance(float meters,
                                       const BleCsCalibrationProfile& profile,
                                       BleCsPhysicalDistanceEstimate* outEstimate);
  static float distanceMetersToEquivalentDelayNs(float meters);
  static float equivalentDelayNsToDistanceMeters(float delayNs);
  static BleCsIqSample parsePctSample(const uint8_t pct[3]);
  static void fillValidChannelMap(uint8_t channelMap[kBleCsChannelMapBytes]);
  static bool getAntennaPathPermutation(uint8_t antennaPathCount,
                                        uint8_t permutationIndex,
                                        uint8_t toneIndex,
                                        uint8_t* outAntennaId);
  static bool parseMode1StepData(const BleCsSubeventStep* step,
                                 BleCsStepMode1Data* outData);
  static bool parseMode2StepData(const BleCsSubeventStep* step,
                                 BleCsStepMode2Data* outData);
  static bool parseMode3StepData(const BleCsSubeventStep* step,
                                 BleCsStepMode3Data* outData);
  static bool parseToneInfo(const uint8_t* toneData,
                            size_t toneDataLen,
                            BleCsStepToneInfo* outInfo);
  static bool parseMode2ToneInfo(const BleCsSubeventStep* step,
                                 uint8_t toneIndex,
                                 BleCsStepToneInfo* outInfo);
  static bool parseMode3ToneInfo(const BleCsSubeventStep* step,
                                 uint8_t toneIndex,
                                 BleCsStepToneInfo* outInfo);
  static void parseSubeventStepData(const uint8_t* stepData,
                                    size_t stepDataLen,
                                    bool (*callback)(const BleCsSubeventStep* step,
                                                     void* userData),
                                    void* userData);
  static bool estimateDistanceFromStepBuffers(const uint8_t* localStepData,
                                              size_t localStepDataLen,
                                              const uint8_t* peerStepData,
                                              size_t peerStepDataLen,
                                              bool localRoleIsInitiator,
                                              BleCsEstimate* outEstimate);
  static bool parseHciSubeventResultEvent(const uint8_t* eventData,
                                          size_t eventLen,
                                          BleCsSubeventResult* outResult);
  static bool parseHciSubeventResultContinueEvent(const uint8_t* eventData,
                                                  size_t eventLen,
                                                  BleCsSubeventResult* outResult);
  static bool estimateDistanceFromSubeventResults(const BleCsSubeventResult& localResult,
                                                  const BleCsSubeventResult& peerResult,
                                                  bool localRoleIsInitiator,
                                                  BleCsEstimate* outEstimate);
  static bool buildHciReadRemoteSupportedCapabilitiesCommand(
      uint16_t connHandle, BleCsHciCommand* outCommand);
  static bool buildHciSetDefaultSettingsCommand(
      uint16_t connHandle, const BleCsDefaultSettings& settings, BleCsHciCommand* outCommand);
  static bool buildHciCreateConfigCommand(uint16_t connHandle,
                                          const BleCsControllerCreateConfig& config,
                                          BleCsHciCommand* outCommand);
  static bool buildHciRemoveConfigCommand(uint16_t connHandle,
                                          uint8_t configId,
                                          BleCsHciCommand* outCommand);
  static bool buildHciSecurityEnableCommand(uint16_t connHandle,
                                            BleCsHciCommand* outCommand);
  static bool buildHciSetProcedureParametersCommand(
      uint16_t connHandle,
      const BleCsProcedureParameters& params,
      BleCsHciCommand* outCommand);
  static bool buildHciProcedureEnableCommand(uint16_t connHandle,
                                             const BleCsProcedureEnable& params,
                                             BleCsHciCommand* outCommand);
  static bool encodeHciCommandPacket(const BleCsHciCommand& command,
                                     uint8_t* outPacket,
                                     size_t maxLen,
                                     size_t* outLen);
  static bool parseHciCommandStatusEvent(const uint8_t* packet,
                                         size_t packetLen,
                                         BleCsHciCommandStatusEvent* outEvent);
  static bool parseHciCommandCompleteEvent(const uint8_t* packet,
                                           size_t packetLen,
                                           BleCsHciCommandCompleteEvent* outEvent);
  static bool parseHciLeMetaEvent(const uint8_t* packet,
                                  size_t packetLen,
                                  BleCsHciLeMetaEvent* outEvent);
  static bool parseHciRemoteSupportedCapabilitiesCompleteEvent(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsControllerCapabilities* outCapabilities);
  static bool parseHciRemoteSupportedCapabilitiesCompleteV2Event(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsControllerCapabilities* outCapabilities);
  static bool parseHciSecurityEnableCompleteEvent(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsSecurityEnableComplete* outEvent);
  static bool parseHciConfigCompleteEvent(const uint8_t* eventData,
                                          size_t eventLen,
                                          BleCsConfigComplete* outEvent);
  static bool parseHciProcedureEnableCompleteEvent(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsProcedureEnableComplete* outEvent);

  // ─── Zephyr Parity: CS Test Mode HCI ───────────────────────
  static bool buildHciTestCommand(const BleCsTestParams& params,
                                  BleCsHciCommand* outCommand);
  static bool buildHciTestCommand(uint16_t unusedConnHandle,
                                  const BleCsTestParams& params,
                                  BleCsHciCommand* outCommand);
  static bool buildHciTestEndCommand(BleCsHciCommand* outCommand);
  static bool parseHciTestEndCompleteEvent(const uint8_t* eventData,
                                           size_t eventLen,
                                           BleCsTestEndComplete* outEvent);
  static bool parseHciTestCompleteEvent(const uint8_t* eventData,
                                         size_t eventLen,
                                         BleCsTestComplete* outEvent);

  // ─── Zephyr Parity: Channel Classification HCI ─────────────
  static bool buildHciSetChannelClassificationCommand(
      const BleCsChannelClassification& classification,
      BleCsHciCommand* outCommand);

